import { ServiceType } from "@/types/types";

export const servicesList: ServiceType[] = [
  {
    title: "Разработка веб-приложений",
    description: `Когда бизнесу становится тесно в рамках обычного сайта, приходит время для веб-приложения.
Мы создаём системы, которые соединяют аналитику, логику и дизайн в одном пространстве — от внутренних платформ до клиентских кабинетов.
Каждый проект строится на современной архитектуре и развивается вместе с вашим бизнесом.`,
    time: "Сроки: от 21 до 220 дней",
    priceStart: 160000,
    priceEnd: 1e7,
  },
  {
    title: "Разработка мобильных приложений",
    description: `Мы проектируем мобильные приложения, которые становятся частью повседневной жизни пользователя. От продуманного UX до публикации в сторах — весь процесс под нашим контролем. Каждое приложение создаётся так, чтобы быть быстрым, удобным и по-настоящему нужным.`,
    time: "Сроки: от 90 до 365 дней",
    priceStart: 600000,
    priceEnd: 3e7,
  },
  {
    title: "Разработка сайтов",
    description: `
Создаём полнофункциональные сайты для компаний, которые хотят увеличить продажи и укрепить позиции на рынке.
Что входит:
<br>

• Проектирование структуры и UI/UX-дизайн
<br>
• Современная адаптивная вёрстка
<br>
• Система управления контентом (CMS)
<br>
• Интеграция с сервисами и CRM
<br>
<br>
Результат:
<br>
— Увеличение доверия к бренду
<br>
— Рост конверсии и лояльности клиентов
<br>
— Автоматизация бизнес-процессов
`,
    time: "Сроки: от 3 до 21 дней",
    priceStart: 130000,
    priceEnd: 3e7,
  },
  {
    title: "Разработка Telegram Mini Apps",
    description: `Создаём интерактивные мини-приложения в Telegram, которые решают бизнес-задачи без скачивания и установки.
Что разрабатываем:
<br>
• Интернет-магазины и каталоги
<br>
• Сервисы бронирования и записи
<br>
<br>

Преимущества:
<br>
— Мгновенный запуск без установки
<br>
— Высокая вовлеченность аудитории
<br>
— Прямая интеграция с Telegram
<br>
— Кроссплатформенность
<br>
<br>

`,
    time: "Сроки: от 10 дней",
    priceStart: 150000,
    priceEnd: 3e7,
  },
  {
    title: "Персональный сайт-визитка",
    description: `
    Создадим лаконичный и стильный сайт, который станет вашим надежным цифровым представительством.
Что входит:
<br>

• Элегантный дизайн, отражающий ваш стиль
<br>
• Все необходимые разделы (о вас, услуги, контакты)
<br>
• Адаптацию для всех устройств
<br>
• Быструю загрузку и базовую SEO-оптимизацию
<br>
<br>
Идеально для:
<br>
— Самопрезентации в сети
<br>
— Привлечения первых клиентов
<br>
— Создания профессионального имиджа

`,
    time: "Сроки: от 10 дней",
    priceStart: 50000,
    priceEnd: 3e7,
  },
  {
    title: "Разработка ботов",
    description: `
Создаём чат-ботов для Telegram и соцсетей, которые экономят ваше время и деньги:
<br>
• Автоматизируем продажи и поддержку
<br>
• Собираем заявки 24/7
<br>
• Интегрируем с CRM и сайтом
<br>
<br>
Идеально для:
<br>
— Онлайн-записи и бронирования
<br>
— Обработки частых вопросов
<br>
— Продаж через мессенджеры 

`,
    time: "Сроки: от 3 дней",
    priceStart: 20000,
    priceEnd: 3e7,
  },
];
