interface Deadline {
  deadline: string[];
  name: string;
}

export const ProjectDeadlines: Deadline[] = [
  {
    name: "mobile",
    deadline: [
      "2-3 месяца",
      "3-6 месяцев",
      "от 6 месяцев",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "website",
    deadline: ["3-4 недели", "1-2 месяца", "От 3 месяцев", "ожидаю оценки"],
  },
  {
    name: "ecommerce",
    deadline: ["1-2 месяца", "2-4 месяца", "От 4 месяцев", "ожидаю оценки"],
  },
  {
    name: "landing",
    deadline: [
      "1-2 недели",
      "3-4 недели",
      "Более месяца",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "webapp",
    deadline: [
      "2-3 месяца",
      "3-6 месяцев",
      "От 6 месяцев",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "telegram",
    deadline: [
      "1-4 недели",
      "1-3 месяца",
      "Более 3 месяцев",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "design",
    deadline: [
      "1-2 недели",
      "3-8 недель",
      "Более 8 недель",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "ecosystem",
    deadline: [
      "4-6 месяцев",
      "6-12 месяцев",
      "Более 12 месяцев",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "marketing",
    deadline: [
      "2-4 недели",
      "1-4 месяцев",
      "Более 4 месяцев",
      "Ожидаю оценки от вас",
    ],
  },
];
