interface Price {
  price: string[];
  name: string;
}

export const ProjectPrice: Price[] = [
  {
    name: "mobile",
    price: [
      "500 000 — 1 000 000 ₽",
      "1 000 000 — 3 000 000 ₽",
      "Более 3 000 000₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "website",
    price: [
      "50 000 — 150 000 ₽",
      "150 000 — 400 000 ₽",
      "Более 400 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "ecommerce",
    price: [
      "200 000 — 600 000 ₽",
      "600 000 — 2 000 000 ₽",
      "Более 2 000 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "landing",
    price: [
      "40 000 — 80 000 ₽",
      "80 000 — 160 000 ₽",
      "Более 160 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "webapp",
    price: [
      "500 000 — 1 000 000 ₽",
      "1 000 000 — 2 500 000 ₽",
      "Более 5 000 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "telegram",
    price: [
      "60 000 — 180 000 ₽",
      "180 000 — 400 000 ₽",
      "Более 400 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "design",
    price: [
      "30 000 — 150 000 ₽",
      "150 000 — 400 000 ₽",
      "Более 400 000₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "ecosystem",
    price: [
      "2 000 000 — 4 000 000 ₽",
      "4 000 000 — 10 000 000 ₽",
      "Более 10 000 000₽",
      "Ожидаю оценки от вас",
    ],
  },
  {
    name: "marketing",
    price: [
      "100 000 — 300 000 ₽",
      "300 000 — 1 000 000 ₽",
      "Более 1 000 000 ₽",
      "Ожидаю оценки от вас",
    ],
  },
];
